{
  "about": "Über",
  "projects": "Projekte",
  "skills": "Skills",



  "about_me": "Über mich",
  "about_me_text_1": "Mein Name ist Jens Behmenburg und ich habe an der Universität Kassel in Deutschland studiert. Dort habe ich meinen Bachelorabschluss in Informatik absolviert. Aktuell studiere ich Informatik im Master.",
  "about_me_text_2": "Während des Studiums habe ich viele Programmiersprachen und Methodiken kennengelernt sowie in der Freizeit vieles ausprobiert und entwickelt.",
  "about_me_text_3": "In meiner Freizeit programmiere ich unter anderem Apps für Android & Windows mit Flutter in Dart. Außerdem beschäftige ich mich mit der Entwicklung von Servern.",
  "about_me_text_4": "Ebenso habe ich an verschiedenen Projekten mitgewirkt oder selbst ganze Projekte entwickelt.",



  "my_projects": "Meine Projekte",
  "show_project": "Projekt zeigen",
  "show_github": "Github zeigen",
  "show_client": "Client zeigen",
  "show_server": "Server zeigen",
  "show_android_app": "Android App zeigen",
  "show_esp32_project": "ESP32-CAM zeigen",

  "project_alpha_text": "Project Alpha ist ein Pixel-Art-Spiel, das aus der Vogelperspektive gespielt wird. Du kannst kämpfen, handeln und erkunden. Und das alles in einer wunderschönen Umgebung, umgeben von NPCs, Feinden und Tieren. Aber aufgepasst! Das Spiel erfordert ein taktisches Vorgehen, um nicht in der Wildnis zu sterben.",

  "accord_client_text_1": "Accord ist eine Anwendung, die ich mit einer Gruppe während meines Studiums entwickelt habe. Diese Anwendung soll ein Discord-Klon sein, in dem es private Chats, Audio-Chats und Server gibt.",
  "accord_client_text_2": "Außerdem habe ich hierfür einen Server entwickelt, der mit MySQL und Spring Boot läuft.",
  "accord_client_text_3": "Ich habe auch eine Android Java-App Version von Accord programmiert, die aber nur zu experimentellen Zwecken diente und daher einen experimentellen Status mit weniger Funktionen hat.",

  "esp32cam_text_1": "Die ESP32-CAM zusammen mit der Android-App ist eine hervorragende Kombination für ein Sicherheitssystem mit Bewegungserkennung.",
  "esp32cam_text_2": "Die ESP32-CAM verfügt über einen WebServer, der den Kamerastream bereitstellt und einen WebSocketServer, der für die Kommunikation von Befehlen zwischen der Android-App und der ESP32-CAM verwendet wird. Darüber hinaus sendet die ESP32-CAM eine Benachrichtigung mit einem Bild an die Android-App, wenn sie eine Bewegung erkennt, welches dann in der App angeschaut werden kann. Auch die Kamerastreams können in der App angeschaut und Bilder und Videos davon aufgenommen werden. Ebenso können die Kameraeinstellungen der ESP32-CAM hierrüber geändert werden.",

  "minirpg_text_1": "Das Mini-RPG war ein Uniprojekt welches wir alleine während des Semesters entwickeln sollten.",
  "minirpg_text_2": "Es ist ein einfaches Mini-RPG-Spiel, in dem du verschiedene Helden erstellen kannst, um gegen Feinde zu kämpfen. Das Spiel wird in einer 2D-Klickansicht präsentiert und bietet Funktionen wie Dungeons mit Feinden, Kämpfe durch Angreifen und Verteidigen, Beute und einen Hardcore-Modus. Das Ziel des Spiels ist es, mit dem Helden Runden gegen Feinde zu kämpfen und zu überleben, sowie ihn aufzuleveln.",

  "android_calculator_text_1": "Dieser Taschenrechner ist eines meiner ersten Android Java Projekte.\nIn ihm können komplexere Formeln mit Klammern ausgewertet werden. Allerdings sind im Moment noch nicht alle Funktionen implementiert.",



  "my_skills": "Meine Skills"
}